FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.c
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2025 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

#include "adc.h"
#include "can.h"
#include "dma.h"
#include "gpio.h"
#include "usart.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#define __APPS_MIN 0.944469f
#define __APPS_MAX 1.75275f
#define __APPS_TOLERANCE 0.035f  // offset de tolerancia para prevenir
#define __APPS_DELTA 420U        // usado para normalizar o valor do APPS
#define APPS_MA_WINDOW_SIZE 10   // Window size for moving average

#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <stm32f767xx.h>
#include <stm32f7xx_hal_can.h>
#include <stm32f7xx_hal_cortex.h>

#include "../Inc/proportional_integral_controller.h"
#include "APPS.h"

#define PUTCHAR_PROTOTYPE int __io_putchar(int ch)

__attribute__((section(".adcarray"))) uint16_t ADC1_VAL[4];
__attribute__((section(".adcarray"))) uint16_t ADC2_APPS[2];  // ADC2_IN5(apps 1) and ADC2_IN6(apps 2)

// Buffers and variables for APPS moving average
uint16_t apps1_buffer[APPS_MA_WINDOW_SIZE];
uint16_t apps2_buffer[APPS_MA_WINDOW_SIZE];
uint8_t apps_buffer_pos = 0;
uint16_t apps1_avg = 0;
uint16_t apps2_avg = 0;

int value = 0;

typedef enum {
    STATE_INIT,                    // Initial startup state
    STATE_STANDBY,                 // Ignition off
    STATE_PRECHARGE,               // Ignition on, precharging
    STATE_WAITING_FOR_R2D_MANUAL,  // Waiting for manual R2D signal
    STATE_WAITING_FOR_R2D_AUTO,    // Waiting for autonomous R2D signal
    STATE_READY_MANUAL,            // Ready to drive in manual mode
    STATE_READY_AUTONOMOUS,        // Ready to drive in autonomous mode
    STATE_AS_EMERGENCY             // Emergency condition detected
} VCU_STATE_t;

VCU_STATE_t current_state = STATE_INIT;   // Current state of the VCU
VCU_STATE_t previous_state = STATE_INIT;  // Previous state of the VCU

const char *state_names[] = {
    "STATE_INIT",
    "STATE_STANDBY",
    "STATE_PRECHARGE",
    "STATE_WAITING_FOR_R2D_MANUAL",
    "STATE_WAITING_FOR_R2D_AUTO",
    "STATE_READY_MANUAL",
    "STATE_READY_AUTONOMOUS",
    "STATE_AS_EMERGENCY"};

void print_state_transition(VCU_STATE_t from, VCU_STATE_t to) {
    printf("\n\rState transition: %s -> %s\n", state_names[from], state_names[to]);
}
// VCU signals structure
typedef struct {
    bool r2d_button_signal;  // R2D signal
    bool r2d_toggle_signal;  // R2D toggle signal
    bool r2d_button_prev;    // Previous state of button for edge detection

    bool r2d_autonomous_signal;  // R2D signal from autonomous system

    uint8_t brake_pressure;  // Brake pressure signal

    bool ignition_ad;             // ignition comming from autonomous system
    bool ignition_switch_signal;  // Ignition signal

    bool precharge_signal;  // Precharge signal
    bool manual;            // Manual mode signal
    bool autonomous;        // Autonomous mode signal

    bool AS_emergency;

    // R2D sound control variables
    bool r2d_sound_playing;         // Flag indicating if R2D sound is currently playing
    bool r2d_sound_completed;       // Flag indicating if R2D sound has been played for current R2D event
    uint32_t r2d_sound_start_time;  // Timestamp when R2D sound started
} VCU_Signals_t;

// Initialize all signals to 0
VCU_Signals_t vcu = {
    .r2d_button_signal = false,
    .r2d_toggle_signal = false,
    .r2d_button_prev = false,
    // All other fields will be initialized to 0/false by default
};

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MPU_Config(void);
/* USER CODE BEGIN PFP */
void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *hadc) {
    // Process the data
}
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/**
 * @brief Measure the brake pressure from an ADC reading
 * @param bits Raw ADC value (12-bit resolution, 0-4095)
 * @return Calculated brake pressure in bar
 * @details Converts ADC reading to voltage, then to pressure using calibration formula.
 *          Sensor characteristics: 28.57mV/bar with 0.5V offset (0 bar = 0.5V)
 */
float MeasureBrakePressure(uint16_t bits) {
    // Constants for clarity
    const float ADC_MAX = 4095.0f;
    const float MCU_VREF = 3.3f;             // MCU reference voltage
    const float SENSOR_VREF = 5.0f;          // Sensor reference voltage
    const float CONVERSION_FACTOR = 0.667f;  // Factor to convert 3.3V to 5V scale
    const float OFFSET_VOLTAGE = 0.5f;       // 0 bar = 0.5V
    const float SENSITIVITY = 0.02857f;      // 28.57mV/bar

