FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
    // Calculate voltage from ADC reading (0-3.3V range)
    float volts = (float)bits * MCU_VREF / ADC_MAX;

    // Scale to sensor voltage range (0-5V)
    volts = volts / CONVERSION_FACTOR;

    // Apply boundary checking for voltage
    if (volts < 0.0f) {
        volts = 0.0f;
    } else if (volts > SENSOR_VREF) {
        volts = SENSOR_VREF;
    }

    // Calculate pressure from voltage using calibration formula:
    // P(bar) = (V - 0.5V) / 0.02857V/bar
    float pressure = 0.0f;
    if (volts <= OFFSET_VOLTAGE) {
        pressure = 0.0f;  // Anything below offset voltage is 0 bar
    } else {
        pressure = (volts - OFFSET_VOLTAGE) / SENSITIVITY;
    }

    // Limit maximum pressure if needed
    const float MAX_PRESSURE = 100.0f;  // Maximum measurable pressure
    if (pressure > MAX_PRESSURE) {
        pressure = MAX_PRESSURE;
    }

    return pressure;  // Return the brake pressure in bar
}

void heartbeat_nonblocking(GPIO_TypeDef *GPIO_Port, uint16_t GPIO_Pin) {
    static uint32_t previous_tick = 0;
    static uint8_t state = 0;

    uint32_t current_tick = HAL_GetTick();

    // State transitions based on timing
    switch (state) {
        case 0:  // First blink ON
            HAL_GPIO_WritePin(GPIO_Port, GPIO_Pin, GPIO_PIN_SET);
            if (current_tick - previous_tick >= 100) {  // 100ms ON
                previous_tick = current_tick;
                state = 1;
            }
            break;

        case 1:  // First blink OFF
            HAL_GPIO_WritePin(GPIO_Port, GPIO_Pin, GPIO_PIN_RESET);
            if (current_tick - previous_tick >= 100) {  // 100ms OFF
                previous_tick = current_tick;
                state = 2;
            }
            break;

        case 2:  // Second blink ON
            HAL_GPIO_WritePin(GPIO_Port, GPIO_Pin, GPIO_PIN_SET);
            if (current_tick - previous_tick >= 100) {  // 100ms ON
                previous_tick = current_tick;
                state = 3;
            }
            break;

        case 3:  // Second blink OFF
            HAL_GPIO_WritePin(GPIO_Port, GPIO_Pin, GPIO_PIN_RESET);
            if (current_tick - previous_tick >= 100) {  // 100ms OFF
                previous_tick = current_tick;
                state = 4;
            }
            break;

        case 4:                                         // Long pause
            if (current_tick - previous_tick >= 500) {  // 500ms pause
                previous_tick = current_tick;
                state = 0;  // Restart cycle
            }
            break;
    }
}

/**
 * @brief LED startup animation
 * @note  This function performs a startup animation for the LEDs.
 */
void startup_leds_animation(void) {
    // LED startup animation
    HAL_GPIO_WritePin(GPIOD, LED_IGN_Pin, GPIO_PIN_SET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_R2D_Pin, GPIO_PIN_SET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_AUTO_Pin, GPIO_PIN_SET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_PWT_Pin, GPIO_PIN_SET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOB, LED_DATA_Pin, GPIO_PIN_SET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOB, LED_Heartbeat_Pin, GPIO_PIN_SET);
    HAL_Delay(350);
    HAL_GPIO_WritePin(GPIOB, LED_Heartbeat_Pin, GPIO_PIN_RESET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOB, LED_DATA_Pin, GPIO_PIN_RESET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_PWT_Pin, GPIO_PIN_RESET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_AUTO_Pin, GPIO_PIN_RESET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_R2D_Pin, GPIO_PIN_RESET);
    HAL_Delay(40);
    HAL_GPIO_WritePin(GPIOD, LED_IGN_Pin, GPIO_PIN_RESET);
    HAL_Delay(40);

    // Turn off all LEDs
    HAL_GPIO_WritePin(GPIOD, LED_IGN_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOD, LED_R2D_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOD, LED_AUTO_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOD, LED_PWT_Pin, GPIO_PIN_RESET);
    HAL_GPIO_WritePin(GPIOB, LED_DATA_Pin, GPIO_PIN_RESET);
}
/**
 * @brief Fade LED in and out using software PWM
 * @param GPIO_Port GPIO port of the LED
 * @param GPIO_Pin GPIO pin of the LED
 */
void led_fade_nonblocking(GPIO_TypeDef *GPIO_Port, uint16_t GPIO_Pin) {
    static uint32_t last_update_time = 0;
    static uint32_t fade_counter = 0;
    static uint32_t pwm_counter = 0;
    static const uint32_t PWM_PERIOD = 100;  // PWM period for software PWM
    static const uint32_t FADE_PERIOD = 50;  // How fast the LED brightness changes

    uint32_t current_time = HAL_GetTick();

    // Update fade counter (determines brightness level)
    if (current_time - last_update_time >= FADE_PERIOD) {
        fade_counter = (fade_counter + 1) % 200;  // 0-199 range for smooth transition
        last_update_time = current_time;
        pwm_counter = 0;  // Reset PWM counter on brightness change
    }

    // Calculate current brightness level (0-100)
    uint32_t brightness;
    if (fade_counter < 100) {
        brightness = fade_counter;  // Fade in (0-99)
    } else {
        brightness = 200 - fade_counter;  // Fade out (99-0)
    }

    // Implement software PWM
    pwm_counter = (pwm_counter + 1) % PWM_PERIOD;

    if (pwm_counter < brightness) {
        HAL_GPIO_WritePin(GPIO_Port, GPIO_Pin, GPIO_PIN_SET);  // Turn LED on
    } else {
        HAL_GPIO_WritePin(GPIO_Port, GPIO_Pin, GPIO_PIN_RESET);  // Turn LED off
    }
}

/**
 * @brief Start playing the Ready-To-Drive sound
 * @details This function activates the buzzer to play the R2D sound
 *          as required by EV4.12 regulations (80-90 dBA, 1-3 seconds).
 */
void StartR2DSound(void) {
    // Activate only if not already playing
    if (!vcu.r2d_sound_playing && !vcu.r2d_sound_completed) {
        vcu.r2d_sound_playing = true;
        vcu.r2d_sound_start_time = HAL_GetTick();

        // Activate buzzer - set the GPIO pin that controls the buzzer
        HAL_GPIO_WritePin(GPIOB, dout4_R2D_Buzzer_Pin, GPIO_PIN_SET);

        printf("\n\rR2D Sound: Started\n\r");
    }
}

/**
 * @brief Update the Ready-To-Drive sound state
 * @details Checks if R2D sound needs to be stopped based on timing
 *          requirements (1-3 seconds continuous sound).
 */
void UpdateR2DSound(void) {
    // If sound is playing, check if it's time to stop
    if (vcu.r2d_sound_playing) {
        uint32_t current_time = HAL_GetTick();
        uint32_t elapsed_time = current_time - vcu.r2d_sound_start_time;

