FSLART/VCU_STM32_Firmware_V1/Core/Src/main.c
                HAL_GPIO_WritePin(GPIOB, dout2_r2d_led_Pin, GPIO_PIN_SET);
                HAL_GPIO_WritePin(GPIOD, LED_R2D_Pin, GPIO_PIN_SET);

                // Play R2D sound when entering a ready state
                StartR2DSound();
                break;

            case STATE_AS_EMERGENCY:
                // Emergency entry actions
                HAL_GPIO_WritePin(GPIOB, dout1_BMS_IGN_Pin, GPIO_PIN_RESET);
                break;
        }
    }
}

/**
 * @brief Handle actions specific to the current state
 */
void HandleState(void) {
    // Update R2D sound status if it's playing
    UpdateR2DSound();

    switch (current_state) {
        case STATE_INIT:
            // Initialization actions
            break;

        case STATE_STANDBY:
            // Turn off R2D LED

            break;

        case STATE_PRECHARGE:
            // Handle precharge process
            HAL_GPIO_WritePin(GPIOD, LED_IGN_Pin, GPIO_PIN_SET);
            break;

        case STATE_WAITING_FOR_R2D_MANUAL:
            // Waiting indicator for manual mode
            // fade in and out the R2D LED
            led_fade_nonblocking(GPIOD, LED_R2D_Pin);
            break;

        case STATE_WAITING_FOR_R2D_AUTO:
            // Waiting indicator for autonomous mode
            led_fade_nonblocking(GPIOD, LED_R2D_Pin);
            break;

        case STATE_READY_MANUAL:
            // Process manual driving controls
            // Send pedal position to inverter

            break;

        case STATE_READY_AUTONOMOUS:
            // Forward autonomous commands to inverter

            break;

        case STATE_AS_EMERGENCY:
            // Activate emergency indicators
            // Sound buzzer
            break;
    }
}

/**
 * @brief Initialize moving average buffers for APPS
 */
void MovingAverage_Init(void) {
    for (int i = 0; i < APPS_MA_WINDOW_SIZE; i++) {
        apps1_buffer[i] = 0;
        apps2_buffer[i] = 0;
    }
    apps_buffer_pos = 0;
    apps1_avg = 0;
    apps2_avg = 0;
}

/**
 * @brief Update moving average with new APPS values
 * @param apps1_raw Raw value from APPS1 sensor
 * @param apps2_raw Raw value from APPS2 sensor
 * @return None, updates apps1_avg and apps2_avg global variables
 */
void MovingAverage_Update(uint16_t apps1_raw, uint16_t apps2_raw) {
    // Add new values to buffers
    apps1_buffer[apps_buffer_pos] = apps1_raw;
    apps2_buffer[apps_buffer_pos] = apps2_raw;

    // Update position for next entry
    apps_buffer_pos = (apps_buffer_pos + 1) % APPS_MA_WINDOW_SIZE;

    // Calculate averages
    uint32_t sum1 = 0;
    uint32_t sum2 = 0;

    for (int i = 0; i < APPS_MA_WINDOW_SIZE; i++) {
        sum1 += apps1_buffer[i];
        sum2 += apps2_buffer[i];
    }

    apps1_avg = (uint16_t)(sum1 / APPS_MA_WINDOW_SIZE);
    apps2_avg = (uint16_t)(sum2 / APPS_MA_WINDOW_SIZE);
}

/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {
    /* USER CODE BEGIN 1 */
    current_state = STATE_INIT;
    /* USER CODE END 1 */

    /* MPU Configuration--------------------------------------------------------*/
    MPU_Config();

    /* Enable the CPU Cache */

    /* Enable I-Cache---------------------------------------------------------*/
    SCB_EnableICache();

    /* Enable D-Cache---------------------------------------------------------*/
    SCB_EnableDCache();

    /* MCU Configuration--------------------------------------------------------*/

    /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
    HAL_Init();

    /* USER CODE BEGIN Init */

    // HAL_ADC_Start_DMA(&hadc3, (uint32_t *)&adc_buffer, 5);

    // HAL_ADC_Start(&hadc3);

    /* USER CODE END Init */

    /* Configure the system clock */
    SystemClock_Config();

    /* USER CODE BEGIN SysInit */

    /* USER CODE END SysInit */

    /* Initialize all configured peripherals */
    MX_GPIO_Init();
    MX_DMA_Init();
    MX_USART1_UART_Init();
    MX_ADC3_Init();
    MX_CAN1_Init();
    MX_ADC1_Init();
    MX_ADC2_Init();
    /* USER CODE BEGIN 2 */
    HAL_CAN_Start(&hcan1);

    startup_leds_animation();
    MovingAverage_Init();  // Initialize moving average buffers

    /* USER CODE END 2 */

    /* Infinite loop */
    /* USER CODE BEGIN WHILE */
    CAN_TxHeaderTypeDef TxHeader;
    uint8_t TxData[3];
    uint32_t TxMailbox;

    // HAL_ADC_Start_DMA(&hadc1, ADC1_VAL, 4);
    HAL_ADC_Start_DMA(&hadc2, ADC2_APPS, 2);  // Start ADC2 for APPS

    APPS_Init(__APPS_MIN, __APPS_MAX, __APPS_TOLERANCE, __APPS_DELTA);  // Initialize APPS

    while (1) {
        /* USER CODE END WHILE */

        /* USER CODE BEGIN 3 */
        heartbeat_nonblocking(GPIOB, LED_Heartbeat_Pin);

        static uint32_t previous_tick = 0;
        uint32_t current_tick = HAL_GetTick();
        if (current_tick - previous_tick >= 200) {
            // Update moving averages with new APPS values

            // Print both raw and averaged APPS values
            printf("\n\rADC2_APPS1: %d (%d avg) ADC2_APPS2: %d (%d avg)\n\r",
                   ADC2_APPS[0], apps1_avg, ADC2_APPS[1], apps2_avg);

            // printf("\n\rADC1: %d ADC2: %d ADC3: %d ADC4: %d\n\r", adc_0, adc_1, adc_2, adc_3);
            // printf("Brake Pressure: %f bar\n\r", MeasureBrakePressure(adc_0));
            // vcu.brake_pressure = MeasureBrakePressure(ADC1_VAL[0]);
            vcu.precharge_signal = 1;  // Simulate precharge signal for testing

            // vcu.brake_pressure = ADC1_VAL[0];
            // printf("\r\n brake_pressure %d", vcu.brake_pressure);
            //  TxHeader.IDE = CAN_ID_STD;
            //  TxHeader.StdId = 0x420;
            //  TxHeader.RTR = CAN_RTR_DATA;
            //  TxHeader.DLC = 3;

            // TxData[0] = 0x01;
            // 330 TxData[1] = 0x02;
            // TxData[2] = 0x03;

